package by.htp.les02.main;

/*
С помощью оператора while напишите программу вывода всехчетных чисел в диапазоне от 2 до 100 включительно
 */

public class Task10 {
	public static void main(String[] args) {
		int a = 2;
		while (a < 102) {
			System.out.println(a);
			a = a + 2;
		}
	}
}
